alirezazd/32raven/stm32/Drivers/usb_cdc.cpp
// SPDX-License-Identifier: GPL-3.0-only
// Copyright (C) 2026 Alireza Azadi

#include "usb_cdc.hpp"

#include <cstring>

#include "error_code.hpp"
#include "irq_priority.hpp"
#include "panic.hpp"
#include "stm32f4xx.h"
#include "system.hpp"

namespace {

// Core register windows
// The DWC2 core scatters its device registers across fixed offsets from the
// peripheral base rather than exposing one struct, so each block gets an
// accessor instead of a macro.

inline USB_OTG_GlobalTypeDef *Global() {
  return reinterpret_cast<USB_OTG_GlobalTypeDef *>(USB_OTG_FS_PERIPH_BASE);
}

inline USB_OTG_DeviceTypeDef *Device() {
  return reinterpret_cast<USB_OTG_DeviceTypeDef *>(USB_OTG_FS_PERIPH_BASE +
                                                   USB_OTG_DEVICE_BASE);
}

inline USB_OTG_INEndpointTypeDef *InEp(uint32_t n) {
  return reinterpret_cast<USB_OTG_INEndpointTypeDef *>(
      USB_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE +
      (n * USB_OTG_EP_REG_SIZE));
}

inline USB_OTG_OUTEndpointTypeDef *OutEp(uint32_t n) {
  return reinterpret_cast<USB_OTG_OUTEndpointTypeDef *>(
      USB_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE +
      (n * USB_OTG_EP_REG_SIZE));
}

// Writes go to the target endpoint's window; every read comes out of the one
// shared RX FIFO, which is why ReadFifo always uses window 0.
inline volatile uint32_t &Fifo(uint32_t n) {
  return *reinterpret_cast<volatile uint32_t *>(
      USB_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (n * USB_OTG_FIFO_SIZE));
}

inline volatile uint32_t &PowerClockGate() {
  return *reinterpret_cast<volatile uint32_t *>(USB_OTG_FS_PERIPH_BASE +
                                                USB_OTG_PCGCCTL_BASE);
}

// Endpoints and FIFO partitioning

constexpr uint32_t kCtrlEp = 0u;
constexpr uint32_t kBulkEp = 1u;    // IN and OUT share the number
constexpr uint32_t kNotifyEp = 2u;  // IN only; CDC requires it to exist

constexpr uint16_t kEp0MaxPacket = UsbCdc::kEp0MaxPacketBytes;
constexpr uint16_t kBulkMaxPacket = UsbCdc::kBulkMaxPacketBytes;
constexpr uint16_t kNotifyMaxPacket = 8u;

// The descriptors below spell these out as literal bytes, which no expression
// can reach, so this is what catches the two drifting apart.
static_assert(kEp0MaxPacket == 0x40u);
static_assert(kBulkMaxPacket == 0x40u);

// OTG FS has 1.25 KB of FIFO RAM = 320 32-bit words, split by hand because the
// core has no allocator. The numbers must sum to <= 320 or transfers silently
// corrupt each other.
constexpr uint32_t kRxFifoWords = 128u;
constexpr uint32_t kTxFifo0Start = kRxFifoWords;
constexpr uint32_t kTxFifo0Words = 64u;
constexpr uint32_t kTxFifo1Start = kTxFifo0Start + kTxFifo0Words;
constexpr uint32_t kTxFifo1Words = 112u;
constexpr uint32_t kTxFifo2Start = kTxFifo1Start + kTxFifo1Words;
constexpr uint32_t kTxFifo2Words = 16u;
static_assert(kTxFifo2Start + kTxFifo2Words <= 320u,
              "OTG FS FIFO allocation exceeds the core's 1.25 KB of RAM");

// Protocol constants

constexpr uint8_t kReqTypeTypeMask = 0x60u;
constexpr uint8_t kReqTypeStandard = 0x00u;
constexpr uint8_t kReqTypeClass = 0x20u;

constexpr uint8_t kReqGetStatus = 0x00u;
constexpr uint8_t kReqClearFeature = 0x01u;
constexpr uint8_t kReqSetFeature = 0x03u;
constexpr uint8_t kReqSetAddress = 0x05u;
constexpr uint8_t kReqGetDescriptor = 0x06u;
constexpr uint8_t kReqGetConfiguration = 0x08u;
constexpr uint8_t kReqSetConfiguration = 0x09u;
constexpr uint8_t kReqGetInterface = 0x0Au;
constexpr uint8_t kReqSetInterface = 0x0Bu;

constexpr uint8_t kDescDevice = 0x01u;
constexpr uint8_t kDescConfiguration = 0x02u;
constexpr uint8_t kDescString = 0x03u;

constexpr uint8_t kCdcSetLineCoding = 0x20u;
constexpr uint8_t kCdcGetLineCoding = 0x21u;
constexpr uint8_t kCdcSetControlLineState = 0x22u;
constexpr uint16_t kCdcControlLineDtr = 0x0001u;

// GRXSTSP packet-status codes (RM0090 §34.16.4).
constexpr uint32_t kPktStsOutData = 0x02u;
constexpr uint32_t kPktStsSetupData = 0x06u;

// PHY turnaround, in PHY clocks. The reset default of 2 corrupts control
// transfers before enumeration finishes; ST's table gives 6 above 32 MHz.
constexpr uint32_t kTurnaroundTime = 6u;

constexpr uint32_t kResetSpinLimit = 200000u;

// These run inside the OTG ISR, so the boot-time limit would let a wedged core
// hold off the watchdog feed for tens of milliseconds.
constexpr uint32_t kFifoFlushSpinLimit = 2000u;
constexpr uint32_t kModeSettleUs = 50000u;

// Well above the 1 ms frame period, far below the UI's status cadence.
constexpr uint32_t kHostSilenceTimeoutUs = 50000u;

// Descriptors

// Device descriptor. VID/PID are patched in from UsbCdcConfig at Init.
uint8_t g_device_desc[] = {
    18u,   kDescDevice, 0x00u, 0x02u,  // bcdUSB 2.00
    0x02u,         // bDeviceClass: CDC, matching a plain ST virtual COM port
    0x00u, 0x00u,  // subclass, protocol
    0x40u,         // bMaxPacketSize0
    0x00u, 0x00u,  // idVendor  (patched)
    0x00u, 0x00u,  // idProduct (patched)
    0x00u, 0x02u,  // bcdDevice 2.00
    0x01u, 0x02u,       0x03u,  // iManufacturer, iProduct, iSerialNumber
    0x01u,                      // bNumConfigurations
};

constexpr size_t kDeviceDescClassOffset = 4;
constexpr size_t kDeviceDescVidOffset = 8;
constexpr size_t kDeviceDescPidOffset = 10;

// Single CDC-ACM configuration: a control interface plus a data interface.
const uint8_t kConfigDesc[] = {
    // Configuration: 67 bytes total, 2 interfaces, bus-powered, 250 mA
    9u,
    kDescConfiguration,
    67u,
    0x00u,
    2u,
    1u,
    0u,
    0x80u,
    125u,

    // Interface 0: CDC communications, ACM subclass, AT-command protocol
    9u,
    0x04u,
    0u,
    0u,
    1u,
    0x02u,
    0x02u,
    0x01u,
    0u,

    // CDC header functional, version 1.10
    5u,
    0x24u,
    0x00u,
    0x10u,
    0x01u,
    // CDC call management: no call management over the data interface
    5u,
    0x24u,
    0x01u,
    0x00u,
    0x01u,
    // CDC ACM functional: supports line coding / control line state
    4u,
    0x24u,
    0x02u,
    0x02u,
    // CDC union: interface 0 controls interface 1
    5u,
    0x24u,
    0x06u,
    0x00u,
    0x01u,

    // Never written to, but Linux refuses to bind without it.
    7u,
    0x05u,
    0x82u,
    0x03u,
    0x08u,
    0x00u,
    0x10u,

