alirezazd/32raven/stm32/Drivers/usb_cdc.cpp
    // Interface 1: CDC data
    9u,
    0x04u,
    1u,
    0u,
    2u,
    0x0Au,
    0x00u,
    0x00u,
    0u,
    // Endpoint 1 OUT, bulk, 64 bytes
    7u,
    0x05u,
    0x01u,
    0x02u,
    0x40u,
    0x00u,
    0x00u,
    // Endpoint 1 IN, bulk, 64 bytes
    7u,
    0x05u,
    0x81u,
    0x02u,
    0x40u,
    0x00u,
    0x00u,
};
static_assert(sizeof(kConfigDesc) == 67u,
              "wTotalLength in the configuration descriptor must match its "
              "actual byte count");

// No notify endpoint here, so TXFIFO2 sits idle in MSC mode.
const uint8_t kMscConfigDesc[] = {
    9u,
    kDescConfiguration,
    32u,
    0x00u,
    1u,
    1u,
    0u,
    0x80u,
    125u,

    // Interface 0: mass storage, SCSI transparent, BOT
    9u,
    0x04u,
    0u,
    0u,
    2u,
    0x08u,
    0x06u,
    0x50u,
    0u,
    // Endpoint 1 IN, bulk, 64 bytes
    7u,
    0x05u,
    0x81u,
    0x02u,
    0x40u,
    0x00u,
    0x00u,
    // Endpoint 1 OUT, bulk, 64 bytes
    7u,
    0x05u,
    0x01u,
    0x02u,
    0x40u,
    0x00u,
    0x00u,
};
static_assert(sizeof(kMscConfigDesc) == 32u,
              "wTotalLength in the configuration descriptor must match its "
              "actual byte count");

// Mass-storage class requests (USB MSC BOT 1.0 §3).
constexpr uint8_t kMscGetMaxLun = 0xFEu;
constexpr uint8_t kMscBotReset = 0xFFu;

constexpr uint8_t kReqRecipientMask = 0x1Fu;
constexpr uint8_t kReqRecipientDevice = 0x00u;
constexpr uint8_t kReqRecipientEndpoint = 0x02u;
constexpr uint16_t kFeatureEndpointHalt = 0x0000u;

const uint8_t kLangIdDesc[] = {4u, kDescString, 0x09u, 0x04u};  // en-US

char HexDigit(uint32_t nibble) {
  return static_cast<char>(nibble < 10u ? ('0' + nibble)
                                        : ('A' + nibble - 10u));
}

}  // namespace

UsbCdc &UsbCdc::GetInstance() {
  static UsbCdc instance;
  return instance;
}

void UsbCdc::Init(const UsbCdcConfig &config) {
  if (initialized_) {
    Panic(ErrorCode::Stm32::kUsbReinit);
  }

  cfg_ = config;
  g_device_desc[kDeviceDescVidOffset] = static_cast<uint8_t>(cfg_.vendor_id);
  g_device_desc[kDeviceDescVidOffset + 1] =
      static_cast<uint8_t>(cfg_.vendor_id >> 8);
  g_device_desc[kDeviceDescPidOffset] = static_cast<uint8_t>(cfg_.product_id);
  g_device_desc[kDeviceDescPidOffset + 1] =
      static_cast<uint8_t>(cfg_.product_id >> 8);

  CoreInit();
  DeviceInit();

  NVIC_SetPriority(OTG_FS_IRQn, irq_priority::kUsbOtgFs);
  NVIC_EnableIRQ(OTG_FS_IRQn);

  // Pull-up stays off; SetAttached is what presents us to a host.
  initialized_ = true;
}

void UsbCdc::Poll(uint32_t now_us) {
  const uint32_t frame =
      (Device()->DSTS & USB_OTG_DSTS_FNSOF_Msk) >> USB_OTG_DSTS_FNSOF_Pos;

  if (frame != last_frame_number_) {
    last_frame_number_ = frame;
    last_frame_change_us_ = now_us;
  }

  // Back-to-back polls legitimately land inside one 1 ms frame.
  host_present_ = (now_us - last_frame_change_us_) <= kHostSilenceTimeoutUs;
}

// Software level plug or unplug by switching the core's built-in D+ pull-up.
void UsbCdc::SetAttached(bool attached) {
  if (attached == attached_) {
    return;
  }
  attached_ = attached;

  if (attached) {
    Device()->DCTL &= ~USB_OTG_DCTL_SDIS;
    return;
  }

  Device()->DCTL |= USB_OTG_DCTL_SDIS;
  // The ISR owns tx_ring_'s tail and rx_ring_'s head, so a Clear() landing
  // mid-PumpTx would put tail behind head and stream the old session's bytes.
  NVIC_DisableIRQ(OTG_FS_IRQn);
  // The next attach must look like a fresh plug-in, not a resumed session.
  configured_ = false;
  dtr_ = false;
  tx_in_flight_ = false;
  tx_zlp_pending_ = false;
  ctrl_out_is_line_coding_ = false;
  current_configuration_ = 0;
  bulk_out_stalled_ = false;
  ep_in_halted_ = false;
  ep_out_halted_ = false;
  rx_ring_.Clear();
  tx_ring_.Clear();
  NVIC_EnableIRQ(OTG_FS_IRQn);
}

void UsbCdc::SetClassMode(ClassMode mode) {
  if (mode == mode_ || attached_) {
    return;
  }
  mode_ = mode;
  // The two personalities must not share a PID: hosts cache descriptors by
  // VID:PID:serial and would bind the COM driver to the disk.
  const uint16_t pid = static_cast<uint16_t>(
      cfg_.product_id + ((mode == ClassMode::kMsc) ? 1u : 0u));
  g_device_desc[kDeviceDescClassOffset] =
      (mode == ClassMode::kMsc) ? 0x00u : 0x02u;
  g_device_desc[kDeviceDescPidOffset] = static_cast<uint8_t>(pid & 0xFFu);
  g_device_desc[kDeviceDescPidOffset + 1] = static_cast<uint8_t>(pid >> 8);
}

void UsbCdc::SetBulkHalt(bool in, bool halt) {
  if (in) {
    ep_in_halted_ = halt;
    if (halt) {
      InEp(kBulkEp)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
    } else {
      InEp(kBulkEp)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
      // Clearing a halt resets the data toggle (USB 2.0 §9.4.5).
      InEp(kBulkEp)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
      tx_in_flight_ = false;
    }
  } else {
    ep_out_halted_ = halt;
    if (halt) {
      OutEp(kBulkEp)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
    } else {
      OutEp(kBulkEp)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
      OutEp(kBulkEp)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
      ArmBulkOut();
    }
  }
}

void UsbCdc::StallBulkIn() {
  NVIC_DisableIRQ(OTG_FS_IRQn);
  SetBulkHalt(true, true);
  NVIC_EnableIRQ(OTG_FS_IRQn);
}

// Clocks the OTG core, resets it, and forces it into device mode.
void UsbCdc::CoreInit() {
  RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
  // The enable takes a few bus cycles to land; reading it back covers the gap.
  (void)RCC->AHB2ENR;

  // Selecting the PHY before the reset is required — the reset is what latches
  // the choice into the core.
  Global()->GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL;

  // The core only accepts a reset once its AHB master is idle.
  uint32_t guard = kResetSpinLimit;
  while ((Global()->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0u) {
    if (--guard == 0u) {
      Panic(ErrorCode::Stm32::kUsbInitFailed);
    }
  }
  Global()->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
  guard = kFifoFlushSpinLimit;
  while ((Global()->GRSTCTL & USB_OTG_GRSTCTL_CSRST) != 0u) {
    if (--guard == 0u) {
      Panic(ErrorCode::Stm32::kUsbInitFailed);
    }
  }

  // PA9 (VBUS) and PA10 (ID) belong to USART1, so NOVBUSSENS stops the core
  // waiting for a session it can never see, and device mode replaces ID.
  // PWRDWN reads backwards: setting it powers the transceiver up.
  Global()->GCCFG = USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_NOVBUSSENS;
  Global()->GUSBCFG = (Global()->GUSBCFG & ~USB_OTG_GUSBCFG_TRDT) |
                      (kTurnaroundTime << USB_OTG_GUSBCFG_TRDT_Pos);
  Global()->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
  // Device registers read stale host-mode values until the role change settles.
  System::GetInstance().Time().DelayMicros(kModeSettleUs);
}

