alirezazd/32raven/stm32/Drivers/usb_cdc.cpp
// Configures the device role and arms the interrupt that drives everything
// after it: speed, FIFO partitioning, endpoint reset, then interrupts on.
void UsbCdc::DeviceInit() {
  PowerClockGate() = 0u;

  // Pull-up held off until configured, so no host enumerates a half-built
  // endpoint set.
  Device()->DCFG |= USB_OTG_DCFG_DSPD;
  Device()->DCTL |= USB_OTG_DCTL_SDIS;

  // Encoding is (size_in_words << 16) | start_in_words; the regions themselves
  // are laid out by the kRxFifo/kTxFifo constants at the top of the file.
  Global()->GRXFSIZ = kRxFifoWords;
  Global()->DIEPTXF0_HNPTXFSIZ = (kTxFifo0Words << 16) | kTxFifo0Start;
  Global()->DIEPTXF[0] = (kTxFifo1Words << 16) | kTxFifo1Start;
  Global()->DIEPTXF[1] = (kTxFifo2Words << 16) | kTxFifo2Start;

  FlushTxFifo(0x10u);  // 0x10 = all transmit FIFOs
  FlushRxFifo();

  // OpenDataEndpoints re-enables only what each endpoint needs.
  Device()->DIEPMSK = 0u;
  Device()->DOEPMSK = 0u;
  Device()->DAINTMSK = 0u;

  // A warm reset leaves transfer sizes and interrupt flags from the last
  // session behind, which would corrupt the first new transfer.
  for (uint32_t ep = 0u; ep <= 3u; ++ep) {
    InEp(ep)->DIEPCTL = 0u;
    InEp(ep)->DIEPTSIZ = 0u;
    InEp(ep)->DIEPINT = 0xFB7Fu;  // write-1-to-clear, every defined flag
    OutEp(ep)->DOEPCTL = 0u;
    OutEp(ep)->DOEPTSIZ = 0u;
    OutEp(ep)->DOEPINT = 0xFB7Fu;
  }

  // Not 0xFFFFFFFF: bit 30 is read-only.
  Global()->GINTSTS = 0xBFFFFFFFu;
  Global()->GINTMSK = USB_OTG_GINTMSK_USBRST | USB_OTG_GINTMSK_ENUMDNEM |
                      USB_OTG_GINTMSK_RXFLVLM | USB_OTG_GINTMSK_IEPINT |
                      USB_OTG_GINTMSK_OEPINT | USB_OTG_GINTMSK_USBSUSPM |
                      USB_OTG_GINTMSK_WUIM;
  // Master switch: until this, the flags above set but no interrupt fires.
  Global()->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
}

// Inside the ISR, so a wedged core is abandoned rather than waited out: the
// following bus reset clears the dirty FIFO anyway.
void UsbCdc::FlushFifo(uint32_t rstctl_write, uint32_t busy_mask) {
  uint32_t guard = kFifoFlushSpinLimit;
  while ((Global()->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0u) {
    if (--guard == 0u) {
      return;
    }
  }
  Global()->GRSTCTL = rstctl_write;
  guard = kFifoFlushSpinLimit;
  while ((Global()->GRSTCTL & busy_mask) != 0u) {
    if (--guard == 0u) {
      return;
    }
  }
}

void UsbCdc::FlushTxFifo(uint32_t fifo_num) {
  FlushFifo(USB_OTG_GRSTCTL_TXFFLSH | (fifo_num << USB_OTG_GRSTCTL_TXFNUM_Pos),
            USB_OTG_GRSTCTL_TXFFLSH);
}

void UsbCdc::FlushRxFifo() {
  FlushFifo(USB_OTG_GRSTCTL_RXFFLSH, USB_OTG_GRSTCTL_RXFFLSH);
}

// Interrupt dispatch

void UsbCdc::IrqHandler() {
  const uint32_t status = Global()->GINTSTS & Global()->GINTMSK;
  if (status == 0u) {
    return;
  }

  if (status & USB_OTG_GINTSTS_RXFLVL) {
    OnRxFifoLevel();
  }
  if (status & USB_OTG_GINTSTS_USBRST) {
    Global()->GINTSTS = USB_OTG_GINTSTS_USBRST;
    OnReset();
  }
  if (status & USB_OTG_GINTSTS_ENUMDNE) {
    Global()->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
    OnEnumDone();
  }
  if (status & USB_OTG_GINTSTS_OEPINT) {
    OnOutEndpoint();
  }
  if (status & USB_OTG_GINTSTS_IEPINT) {
    OnInEndpoint();
  }
  // Acknowledged but not recorded: host presence comes from the frame counter,
  // and dtr_ deliberately survives a suspend -- a host that parks an idle port
  // has not closed it, and will not re-send SET_CONTROL_LINE_STATE on resume.
  if (status & USB_OTG_GINTSTS_USBSUSP) {
    Global()->GINTSTS = USB_OTG_GINTSTS_USBSUSP;
  }
  if (status & USB_OTG_GINTSTS_WKUINT) {
    Global()->GINTSTS = USB_OTG_GINTSTS_WKUINT;
  }
}

void UsbCdc::OnReset() {
  reset_count_ = reset_count_ + 1;
  ctrl_out_is_line_coding_ = false;
  configured_ = false;
  dtr_ = false;
  tx_in_flight_ = false;
  tx_zlp_pending_ = false;

  Device()->DCTL &= ~USB_OTG_DCTL_RWUSIG;
  FlushTxFifo(0x10u);

  for (uint32_t ep = 0u; ep <= 3u; ++ep) {
    InEp(ep)->DIEPINT = 0xFB7Fu;
    OutEp(ep)->DOEPINT = 0xFB7Fu;
  }

  Device()->DAINTMSK = (1u << kCtrlEp) | (1u << (kCtrlEp + 16u));
  Device()->DOEPMSK =
      USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM | USB_OTG_DOEPMSK_EPDM;
  Device()->DIEPMSK =
      USB_OTG_DIEPMSK_XFRCM | USB_OTG_DIEPMSK_TOM | USB_OTG_DIEPMSK_EPDM;

  Device()->DCFG &= ~USB_OTG_DCFG_DAD;
  PrepareEp0Setup();
}

void UsbCdc::OnEnumDone() {
  InEp(kCtrlEp)->DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ;  // MPSIZ 0 = 64 bytes
  Device()->DCTL |= USB_OTG_DCTL_CGINAK;
}

void UsbCdc::OnRxFifoLevel() {
  Global()->GINTMSK &= ~USB_OTG_GINTMSK_RXFLVLM;

  const uint32_t status = Global()->GRXSTSP;
  const uint32_t ep = status & USB_OTG_GRXSTSP_EPNUM;
  const uint16_t count =
      static_cast<uint16_t>((status & USB_OTG_GRXSTSP_BCNT) >> 4);
  const uint32_t pktsts =
      (status & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos;

  if (pktsts == kPktStsSetupData && count == sizeof(SetupPacket)) {
    ReadFifo(reinterpret_cast<uint8_t *>(&setup_), count);
  } else if (pktsts == kPktStsOutData && count > 0u) {
    if (ep == kCtrlEp) {
      const uint16_t len =
          count > sizeof(ctrl_out_buf_) ? sizeof(ctrl_out_buf_) : count;
      ReadFifo(ctrl_out_buf_, len);
    } else {
      const uint16_t len =
          count > sizeof(bulk_out_buf_) ? sizeof(bulk_out_buf_) : count;
      ReadFifo(bulk_out_buf_, len);
      rx_ring_.PushBlock(bulk_out_buf_, len);
    }
  } else if (count > 0u) {
    // Status-only entries carry no payload; anything else with a byte count
    // must still be drained or the FIFO read pointer desynchronises.
    uint8_t discard[4];
    for (uint16_t i = 0u; i < count; i = static_cast<uint16_t>(i + 4u)) {
      const uint16_t left = static_cast<uint16_t>(count - i);
      ReadFifo(discard, left > 4u ? 4u : left);
    }
  }

  Global()->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
}

void UsbCdc::OnOutEndpoint() {
  uint32_t pending = (Device()->DAINT & Device()->DAINTMSK) >> 16;
  for (uint32_t ep = 0u; pending != 0u && ep <= 3u; ++ep, pending >>= 1) {
    if ((pending & 1u) == 0u) {
      continue;
    }
    const uint32_t flags = OutEp(ep)->DOEPINT;
    // Same reasoning as the IN side: unacknowledged bits latch the level-driven
    // OEPINT and wedge the interrupt on.
    OutEp(ep)->DOEPINT = flags;

    if (flags & USB_OTG_DOEPINT_STUP) {
      HandleSetup();
    }
    if (flags & USB_OTG_DOEPINT_XFRC) {
      if (ep == kCtrlEp) {
        if (ctrl_out_is_line_coding_) {
          ctrl_out_is_line_coding_ = false;
          std::memcpy(&line_coding_, ctrl_out_buf_, sizeof(line_coding_));
          ControlSendZlp();
        }
        PrepareEp0Setup();
      } else {
        ArmBulkOut();
      }
    }
  }
}

void UsbCdc::OnInEndpoint() {
  uint32_t pending = Device()->DAINT & Device()->DAINTMSK & 0xFFFFu;
  for (uint32_t ep = 0u; pending != 0u && ep <= 3u; ++ep, pending >>= 1) {
    if ((pending & 1u) == 0u) {
      continue;
    }
    const uint32_t flags = InEp(ep)->DIEPINT;
    // Acknowledge everything up front, including bits we take no action on.
    // DAINT and GINTSTS.IEPINT are level flags derived from DIEPINT, so a bit
    // left standing (a timeout on an abandoned control transfer, say) re-enters
    // this handler forever and starves thread mode into a watchdog reset.
    InEp(ep)->DIEPINT = flags;

    if (flags & USB_OTG_DIEPINT_XFRC) {
      if (ep == kCtrlEp) {
        if (ctrl_in_remaining_ > 0u || ctrl_in_zlp_) {
          if (ctrl_in_remaining_ == 0u) {
            ctrl_in_zlp_ = false;
          }
          ControlInPacket();
        } else {
          PrepareEp0Setup();
        }
      } else if (ep == kBulkEp) {
        tx_in_flight_ = false;
        // A maximum-size packet does not end the host's bulk transfer; without
        // a following zero-length packet the data can sit in the host's buffer
        // until the next write happens to arrive. CDC only: BOT transfers are
        // exact-length, and a ZLP mid data-phase ends the host's read early.
        if (mode_ == ClassMode::kCdc && last_tx_len_ == kBulkMaxPacket &&
            tx_ring_.IsEmpty()) {
          tx_zlp_pending_ = true;
        }
        PumpTx();
      }
    }
  }
}

