alirezazd/32raven/stm32/Drivers/usb_cdc.cpp
// FIFO access

void UsbCdc::ReadFifo(uint8_t *dest, uint16_t len) {
  const uint16_t words = static_cast<uint16_t>(len / 4u);
  for (uint16_t i = 0u; i < words; ++i) {
    const uint32_t value = Fifo(0u);
    dest[0] = static_cast<uint8_t>(value);
    dest[1] = static_cast<uint8_t>(value >> 8);
    dest[2] = static_cast<uint8_t>(value >> 16);
    dest[3] = static_cast<uint8_t>(value >> 24);
    dest += 4;
  }
  const uint16_t tail = static_cast<uint16_t>(len % 4u);
  if (tail != 0u) {
    uint32_t value = Fifo(0u);
    for (uint16_t i = 0u; i < tail; ++i) {
      dest[i] = static_cast<uint8_t>(value);
      value >>= 8;
    }
  }
}

void UsbCdc::WriteFifo(uint8_t ep_num, const uint8_t *src, uint16_t len) {
  const uint16_t words = static_cast<uint16_t>((len + 3u) / 4u);
  for (uint16_t i = 0u; i < words; ++i) {
    uint32_t value = 0u;
    const uint16_t offset = static_cast<uint16_t>(i * 4u);
    const uint16_t left = static_cast<uint16_t>(len - offset);
    const uint16_t chunk = left > 4u ? 4u : left;
    for (uint16_t b = 0u; b < chunk; ++b) {
      value |= static_cast<uint32_t>(src[offset + b]) << (8u * b);
    }
    Fifo(ep_num) = value;
  }
}

// Control transfers

void UsbCdc::PrepareEp0Setup() {
  OutEp(kCtrlEp)->DOEPTSIZ = (1u << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
                             (3u * sizeof(SetupPacket)) |
                             USB_OTG_DOEPTSIZ_STUPCNT;
  // Hardware accepts SETUP packets unconditionally, but the status stage that
  // ends a control transfer is an ordinary OUT packet: without enabling the
  // endpoint and clearing NAK here, every transfer is answered and then hangs
  // on its status stage until the host gives up and resets.
  OutEp(kCtrlEp)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
}

void UsbCdc::PrepareEp0Out(uint16_t len) {
  OutEp(kCtrlEp)->DOEPTSIZ =
      (1u << USB_OTG_DOEPTSIZ_PKTCNT_Pos) | static_cast<uint32_t>(len);
  OutEp(kCtrlEp)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
}

void UsbCdc::ControlInPacket() {
  const uint16_t chunk =
      ctrl_in_remaining_ > kEp0MaxPacket ? kEp0MaxPacket : ctrl_in_remaining_;
  InEp(kCtrlEp)->DIEPTSIZ =
      (1u << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | static_cast<uint32_t>(chunk);
  InEp(kCtrlEp)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
  if (chunk > 0u) {
    WriteFifo(kCtrlEp, ctrl_in_ptr_, chunk);
    ctrl_in_ptr_ += chunk;
    ctrl_in_remaining_ = static_cast<uint16_t>(ctrl_in_remaining_ - chunk);
  }
}

void UsbCdc::ControlSend(const uint8_t *data, uint16_t len) {
  if (len > setup_.w_length) {
    len = setup_.w_length;
  }
  ctrl_in_ptr_ = data;
  ctrl_in_remaining_ = len;
  // A reply shorter than the host asked for must end on a short packet. When
  // the truncated length lands exactly on a packet boundary, an explicit
  // zero-length packet is the only way to signal the end.
  ctrl_in_zlp_ =
      (len < setup_.w_length) && (len != 0u) && ((len % kEp0MaxPacket) == 0u);
  ControlInPacket();
}

void UsbCdc::ControlSendZlp() {
  ctrl_in_ptr_ = nullptr;
  ctrl_in_remaining_ = 0u;
  ctrl_in_zlp_ = false;
  InEp(kCtrlEp)->DIEPTSIZ = (1u << USB_OTG_DIEPTSIZ_PKTCNT_Pos);
  InEp(kCtrlEp)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
}

void UsbCdc::ControlStall() {
  InEp(kCtrlEp)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
  OutEp(kCtrlEp)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
  PrepareEp0Setup();
}

void UsbCdc::HandleSetup() {
  const SetupPacket setup = setup_;
  const uint8_t type = setup.bm_request_type & kReqTypeTypeMask;

  bool handled = false;
  if (type == kReqTypeStandard) {
    handled = HandleStandardRequest(setup);
  } else if (type == kReqTypeClass) {
    handled = HandleClassRequest(setup);
  }

  if (!handled) {
    ControlStall();
  }
}

bool UsbCdc::HandleStandardRequest(const SetupPacket &setup) {
  switch (setup.b_request) {
    case kReqGetDescriptor: {
      const uint8_t desc_type = static_cast<uint8_t>(setup.w_value >> 8);
      const uint8_t desc_index = static_cast<uint8_t>(setup.w_value);
      if (desc_type == kDescDevice) {
        ControlSend(g_device_desc, sizeof(g_device_desc));
        return true;
      }
      if (desc_type == kDescConfiguration) {
        if (mode_ == ClassMode::kMsc) {
          ControlSend(kMscConfigDesc, sizeof(kMscConfigDesc));
        } else {
          ControlSend(kConfigDesc, sizeof(kConfigDesc));
        }
        return true;
      }
      if (desc_type == kDescString) {
        if (desc_index == 0u) {
          ControlSend(kLangIdDesc, sizeof(kLangIdDesc));
          return true;
        }
        const uint16_t len = BuildStringDescriptor(desc_index);
        if (len == 0u) {
          return false;
        }
        ControlSend(string_desc_buf_, len);
        return true;
      }
      // Device qualifier and anything else: this is a full-speed-only device,
      // and stalling is how the host is told so.
      return false;
    }

    case kReqSetAddress:
      if (setup.w_value > 127u) {
        return false;
      }
      Device()->DCFG =
          (Device()->DCFG & ~USB_OTG_DCFG_DAD) |
          (static_cast<uint32_t>(setup.w_value) << USB_OTG_DCFG_DAD_Pos);
      ControlSendZlp();
      return true;

    case kReqSetConfiguration:
      if (setup.w_value == 0u) {
        configured_ = false;
        CloseDataEndpoints();
      } else {
        OpenDataEndpoints();
        configured_ = true;
      }
      ControlSendZlp();
      return true;

    case kReqGetConfiguration: {
      current_configuration_ = configured_ ? 1u : 0u;
      ControlSend(&current_configuration_, 1u);
      return true;
    }

    case kReqGetStatus: {
      const uint8_t recipient = setup.bm_request_type & kReqRecipientMask;
      if (recipient == kReqRecipientEndpoint) {
        // BOT recovery reads this back, so it must be the real halt state.
        const uint8_t ep = static_cast<uint8_t>(setup.w_index & 0x0Fu);
        const bool in = (setup.w_index & 0x80u) != 0u;
        const bool halted =
            (ep == kBulkEp) && (in ? ep_in_halted_ : ep_out_halted_);
        status_reply_[0] = halted ? 1u : 0u;
        status_reply_[1] = 0u;
        ControlSend(status_reply_, sizeof(status_reply_));
        return true;
      }
      static const uint8_t kDeviceStatus[2] = {0u, 0u};
      ControlSend(kDeviceStatus, sizeof(kDeviceStatus));
      return true;
    }

    case kReqGetInterface: {
      static const uint8_t kAltSetting = 0u;
      ControlSend(&kAltSetting, 1u);
      return true;
    }

