alirezazd/32raven/stm32/Drivers/usb_cdc.cpp
    case kReqClearFeature:
    case kReqSetFeature: {
      const uint8_t recipient = setup.bm_request_type & kReqRecipientMask;
      if (recipient == kReqRecipientEndpoint &&
          setup.w_value == kFeatureEndpointHalt) {
        const uint8_t ep = static_cast<uint8_t>(setup.w_index & 0x0Fu);
        const bool in = (setup.w_index & 0x80u) != 0u;
        if (ep == kBulkEp) {
          SetBulkHalt(in, setup.b_request == kReqSetFeature);
        }
      }
      ControlSendZlp();
      return true;
    }

    case kReqSetInterface:
      ControlSendZlp();
      return true;

    default:
      return false;
  }
}

bool UsbCdc::HandleClassRequest(const SetupPacket &setup) {
  if (mode_ == ClassMode::kMsc) {
    switch (setup.b_request) {
      case kMscGetMaxLun:
        max_lun_reply_ = 0u;
        ControlSend(&max_lun_reply_, 1u);
        return true;
      case kMscBotReset:
        // Halts survive: BOT has the host clear them with CLEAR_FEATURE.
        msc_reset_count_ = msc_reset_count_ + 1u;
        ControlSendZlp();
        return true;
      default:
        return false;
    }
  }
  switch (setup.b_request) {
    case kCdcSetLineCoding:
      if (setup.w_length != sizeof(LineCoding)) {
        return false;
      }
      ctrl_out_is_line_coding_ = true;
      PrepareEp0Out(sizeof(LineCoding));
      return true;

    case kCdcGetLineCoding:
      ControlSend(reinterpret_cast<const uint8_t *>(&line_coding_),
                  sizeof(line_coding_));
      return true;

    case kCdcSetControlLineState:
      dtr_ = (setup.w_value & kCdcControlLineDtr) != 0u;
      ControlSendZlp();
      return true;

    default:
      return false;
  }
}

uint16_t UsbCdc::BuildStringDescriptor(uint8_t index) {
  const char *text = nullptr;
  char serial[25];

  if (index == 1u) {
    text = cfg_.manufacturer;
  } else if (index == 2u) {
    text = (mode_ == ClassMode::kMsc) ? cfg_.product_msc : cfg_.product;
  } else if (index == 3u) {
    const volatile uint32_t *uid =
        reinterpret_cast<const volatile uint32_t *>(UID_BASE);
    size_t pos = 0u;
    for (uint32_t word = 0u; word < 3u; ++word) {
      const uint32_t value = uid[word];
      for (int32_t nibble = 7; nibble >= 0; --nibble) {
        serial[pos++] = HexDigit((value >> (nibble * 4)) & 0xFu);
      }
    }
    serial[pos] = '\0';
    text = serial;
  }

  if (text == nullptr) {
    return 0u;
  }

  size_t len = std::strlen(text);
  const size_t max_chars = (sizeof(string_desc_buf_) - 2u) / 2u;
  if (len > max_chars) {
    len = max_chars;
  }

  string_desc_buf_[0] = static_cast<uint8_t>(2u + (len * 2u));
  string_desc_buf_[1] = kDescString;
  for (size_t i = 0u; i < len; ++i) {
    string_desc_buf_[2u + (i * 2u)] = static_cast<uint8_t>(text[i]);
    string_desc_buf_[3u + (i * 2u)] = 0u;
  }
  return string_desc_buf_[0];
}

// Data endpoints

void UsbCdc::OpenDataEndpoints() {
  InEp(kBulkEp)->DIEPCTL = USB_OTG_DIEPCTL_USBAEP |
                           (2u << USB_OTG_DIEPCTL_EPTYP_Pos) |  // bulk
                           (kBulkEp << USB_OTG_DIEPCTL_TXFNUM_Pos) |
                           USB_OTG_DIEPCTL_SD0PID_SEVNFRM | kBulkMaxPacket;

  if (mode_ == ClassMode::kCdc) {
    InEp(kNotifyEp)->DIEPCTL =
        USB_OTG_DIEPCTL_USBAEP | (3u << USB_OTG_DIEPCTL_EPTYP_Pos) |
        (kNotifyEp << USB_OTG_DIEPCTL_TXFNUM_Pos) |
        USB_OTG_DIEPCTL_SD0PID_SEVNFRM | kNotifyMaxPacket;
  }

  OutEp(kBulkEp)->DOEPCTL = USB_OTG_DOEPCTL_USBAEP |
                            (2u << USB_OTG_DOEPCTL_EPTYP_Pos) |  // bulk
                            USB_OTG_DOEPCTL_SD0PID_SEVNFRM | kBulkMaxPacket;

  Device()->DAINTMSK |= (1u << kBulkEp) | (1u << (kBulkEp + 16u));
  if (mode_ == ClassMode::kCdc) {
    Device()->DAINTMSK |= (1u << kNotifyEp);
  }

  ep_in_halted_ = false;
  ep_out_halted_ = false;
  tx_in_flight_ = false;
  tx_zlp_pending_ = false;
  ArmBulkOut();
}

void UsbCdc::CloseDataEndpoints() {
  Device()->DAINTMSK &=
      ~((1u << kBulkEp) | (1u << kNotifyEp) | (1u << (kBulkEp + 16u)));
  InEp(kBulkEp)->DIEPCTL &= ~USB_OTG_DIEPCTL_USBAEP;
  InEp(kNotifyEp)->DIEPCTL &= ~USB_OTG_DIEPCTL_USBAEP;
  OutEp(kBulkEp)->DOEPCTL &= ~USB_OTG_DOEPCTL_USBAEP;
}

// Re-arming unconditionally would make the device ACK packets it has nowhere to
// put, punching holes into the middle of a frame that the parser then reads as
// payload. Leaving the endpoint unarmed NAKs instead, so the host retries and
// the sender sees real back-pressure.
void UsbCdc::ArmBulkOut() {
  if ((rx_ring_.Capacity() - rx_ring_.Available()) < kBulkMaxPacket) {
    bulk_out_stalled_ = true;
    return;
  }
  bulk_out_stalled_ = false;
  OutEp(kBulkEp)->DOEPTSIZ =
      (1u << USB_OTG_DOEPTSIZ_PKTCNT_Pos) | kBulkMaxPacket;
  OutEp(kBulkEp)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
}

void UsbCdc::PumpTx() {
  if (!configured_ || tx_in_flight_) {
    return;
  }

  if (tx_zlp_pending_) {
    tx_zlp_pending_ = false;
    tx_in_flight_ = true;
    last_tx_len_ = 0u;
    InEp(kBulkEp)->DIEPTSIZ = (1u << USB_OTG_DIEPTSIZ_PKTCNT_Pos);
    InEp(kBulkEp)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
    return;
  }

  const size_t avail = tx_ring_.Available();
  if (avail == 0u) {
    return;
  }
  const size_t send_len = (avail > kBulkMaxPacket) ? kBulkMaxPacket : avail;

  const uint32_t words_needed = (static_cast<uint32_t>(send_len) + 3u) / 4u;
  if ((InEp(kBulkEp)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV) < words_needed) {
    return;
  }

  // A short packet ends the host's transfer, legal in BOT only at a phase
  // boundary, so a packet split by the ring's wrap must be reassembled.
  auto chunk = tx_ring_.ContiguousReadable();
  const uint8_t *src = chunk.data();
  if (chunk.size() < send_len) {
    for (size_t i = 0; i < send_len; ++i) {
      (void)tx_ring_.Pop(tx_stage_[i]);
    }
    src = tx_stage_;
  }

  tx_in_flight_ = true;
  last_tx_len_ = static_cast<uint16_t>(send_len);
  InEp(kBulkEp)->DIEPTSIZ =
      (1u << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | static_cast<uint32_t>(send_len);
  InEp(kBulkEp)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
  WriteFifo(kBulkEp, src, static_cast<uint16_t>(send_len));
  if (src != tx_stage_) {
    tx_ring_.Consume(send_len);
  }
}

// Public data path

size_t UsbCdc::Send(const uint8_t *data, size_t len) {
  if (data == nullptr || len == 0u || !configured_) {
    return 0u;
  }
  const size_t written = tx_ring_.PushBlock(data, len);

  NVIC_DisableIRQ(OTG_FS_IRQn);
  PumpTx();
  NVIC_EnableIRQ(OTG_FS_IRQn);

  return written;
}

bool UsbCdc::Read(uint8_t &out) {
  const bool got = rx_ring_.Pop(out);
  // Space only reappears here, so this is where a NAKing endpoint gets revived.
  if (got && bulk_out_stalled_ && configured_) {
    NVIC_DisableIRQ(OTG_FS_IRQn);
    ArmBulkOut();
    NVIC_EnableIRQ(OTG_FS_IRQn);
  }
  return got;
}

extern "C" void UsbCdcOnIrq(void) { UsbCdc::GetInstance().IrqHandler(); }
